Revit 2027 API
WorksetPreview.IsDefaultWorkset Property
 Whether the workset is the default one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDefaultWorkset { get; }
Public ReadOnly Property IsDefaultWorkset As Boolean
	Get
public:
property bool IsDefaultWorkset {
	bool get ();
}
member IsDefaultWorkset : bool with get
Property Value
Boolean
See Also
Reference
WorksetPreview Class
Autodesk.Revit.DB Namespace